77
Укажите минимальное число R, которое превышает 43 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе.
46
Укажите такое наименьшее число N, для которого результат работы алгоритма больше числа 77. В ответе это число запишите в десятичной системе счисления.
19
Укажите такое наименьшее число N, для которого результат работы алгоритма больше 97. В ответе это число запишите в десятичной системе счисления.
25
Укажите минимальное число R, которое превышает число 83 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.
86
Укажите такое наименьшее число R, которое превышает 114 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе счисления.
115
Какое наименьшее число, большее 97, может появиться на экране в результате работы автомата?
102
Какое наименьшее число, большее 93, может появиться на экране в результате работы автомата?
96
Укажите минимальное число N, для которого результат работы алгоритма будет больше 115. В ответе это число запишите в десятичной системе счисления.
29
Какое наименьшее число, большее 105, может появиться на экране в результате работы автомата?
111
Укажите максимальное число R, которое не превышает 102 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.
101
Укажите минимальное число R, которое больше 102 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.
105
Какое число нужно ввести в автомат, чтобы в результате получилось 2018?
1009
Какое число нужно ввести в автомат, чтобы в результате получилось 2017?
1008
Какое число нужно ввести в автомат, чтобы в результате получилось 133?
61
Какое число нужно ввести в автомат, чтобы в результате получилось 111?
72
Сколько разных значений будет показано на экране автомата при последовательном вводе всех натуральных чисел от 10 до 1000?
7
Сколько разных значений будет показано на экране автомата при последовательном вводе всех натуральных чисел от 100 до 3000?
6
Укажите минимальное число R, которое превышает 123 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе.
126
Укажите минимальное число R, которое превышает число 55 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.
58
Какое наибольшее число, не превышающее 100, после обработки автоматом даёт результат 13?
88
Какое наименьшее число, превышающее 80, может получиться в результате работы автомата?
82
Какое наименьшее число, превышающее 100, может получиться в результате работы автомата?
103
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 85. В ответе запишите это число в десятичной системе счисления.
21
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 52. В ответе запишите это число в десятичной системе счисления.
3
Укажите минимальное число R, которое превышает 54 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе.
56
Укажите минимальное число R, которое превышает число 97 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.
102
Укажите минимальное число N, для которого результат работы алгоритма будет больше 134. В ответе это число запишите в десятичной системе счисления.
33
Укажите максимальное число N, для которого результат работы алгоритма будет меньше 134. В ответе это число запишите в десятичной системе счисления.
32
Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число менее 94. В ответе это число запишите в десятичной системе.
22
Укажите наибольшее число R меньшее 109, которое может получиться после обработки этого алгоритма. В ответе это число запишите в десятичной системе.
106
Какое наибольшее число, меньшее 100, может появиться на экране в результате работы автомата?
96
Какое наибольшее число, меньшее 90, может появиться на экране в результате работы автомата?
86
На экран выводится число 35.Какое наименьшее трёхзначное число может появиться на экране в результате работы автомата?
103
Укажите такое наименьшее число N, для которого результат работы данного алгоритма больше числа 77. В ответе это число запишите в десятичной системе счисления.
19
При каком наименьшем исходном N результат на экране автомата будет больше 90?
23
роичная запись числа N: 102.

2.Остаток от деления 11на 3 равен 2, новая запись 1022.3На экран выводится число 35.Какое наименьшее четырёхзначное число может появиться на экране в результате работы автомата?
1003
Какое число нужно ввести в автомат, чтобы в результате получилось 105?
180
Укажите такое наименьшее число N, для которого результат работы алгоритма больше 125. В ответе это число запишите в десятичной системе счисления.
31
Какое число нужно ввести в автомат, чтобы в результате получилось 185?
220
При каком наименьшем исходном N результат на экране автомата будет больше 74?
19
При каком наименьшем числе N в результате работы алгоритма получится R >170? В ответе запишите это число в десятичной системе счисления.
43
При каком наименьшем числе N в результате работы алгоритма получится R>154? В ответе запишите это число в десятичной системе счисления.
39
При каком наименьшем числе N в результате работы алгоритма получится R>150? В ответе запишите это число в десятичной системе счисления.
38
При каком наименьшем числе N в результате работы алгоритма получится R>180? В ответе запишите это число в десятичной системе счисления.
46
При каком наименьшем числе N в результате работы алгоритма получится R>92? В ответе запишите это число в десятичной системе счисления.
48
При каком наименьшем числе N в результате работы алгоритма получится R>76? В ответе запишите это число в десятичной системе счисления.
40
При каком наименьшем числе N>99в результате работы алгоритма получится число, кратное 4?
103
При каком наименьшем числе N>104в результате работы алгоритма получится число, кратное 4?
107
Укажите минимальное число R, которое превышает число 396 и может являться результатом работы данного алгоритма. В ответе это число запишите в десятичной системе счисления.
402
Укажите наименьшее число, большее 52, которое может является результатом работы автомата.
56
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, большее, чем 441. В ответе запишите это число в десятичной системе счисления.
47
При каком наименьшем N в результате работы алгоритма получится R=5?
1023
При каком наименьшем N в результате работы алгоритма получится R=4?
225
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, большее 40. В ответе запишите это число в десятичной системе счисления.
16